Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/asylum_seekers_and_refugees/the_asylum_process_in_ireland/minister_for_justice.html.txt.tmx
Source language: en
Languages: ga

source: Decisions made by the Minister for Justice and Equality in relation to international protection
ga: Cinntí a dhéanann an tAire Dlí agus Cirt agus Comhionnanais maidir le cosaint idirnáisiúnta

source: • If you are given a declaration
ga: • Má thugtar dearbhú duit

source: • If you are refused a declaration
ga: • Má tá dearbhú diúltaithe

source: • If the Minister makes a deportation order to remove you from the State
ga: • Má bheartaíonn an tAire Dlí agus Cirt ordú díbeartha le do bhaint den stát

source: If the International Protection Office or the International Protection Appeals Tribunal makes a recommendation to the Minister for Justice and Equality that you should be given a refugee or subsidiary protection declaration, the Minister will give you a declaration in writing stating that you are a refugee or are eligible for subsidiary protection, subject to considerations of national security or public order
ga: Má dhéanann an Oifig um Chosaint Idirnáisiúnta nó an Bínse Achomhairc um Chosaint Idirnáisiúnta moladh chuig an Aire Dlí agus Cirt agus Comhionannais gur chóir dearbhú mar theifeach nó dearbhú cosanta tánaisteach a thabhairt duit, tabharfaidh an tAire dearbhú i scríbhinn duit ag maíomh gur teifeach tú nó atá i dteideal cosaint idirnáisiúnta, bunaithe ar chúrsaí slándála náisiúnta nó earnáil phoiblí

source: If you are given a declaration
ga: Má thugtar dearbhú duit

source: If the Minister decides to give you a refugee or subsidiary protection declaration, in accordance with the International Protection Act 2015, you are then entitled to:
ga: Má shocraíonn an tAire dearbhú teifigh nó dearbhú cosanta tánaisteach, de réir an Acht um Chosaint Idirnáisiúnta 2015, tá tú i dteideal:

source: • Seek and enter employment in the State
ga: • fostaíocht a lorg agus chun dul i mbun fostaíochta sa Stát

source: • Carry on any business, trade or profession in the State
ga: • Aon ghnó, ceird nó gairm a chleachtadh sa Stát

source: • Have access to education and training in the same manner and to the same extent in all respects as an Irish citizen
ga: • Rochtain ar oideachas agus oiliúint a bheith agat ar an mbealach céanna agus ar a mhéad céanna i ngach gné le saoránach Éireannach

source: • Receive the same medical care and services and the same social welfare benefits as an Irish citizen
ga: • An cúram agus na seirbhísí leighis chéanna agus na sochair leasa shóisialaigh chéanna a fháil le saoránach Éireannach

source: • Have the same rights of travel in, to or from the State as Irish citizens. Note: this is on the basis that the Minister for Justice and Equality issues a travel document)
ga: • Na cearta céanna a bheith agat um thaisteal istigh, isteach nó amach ón Stát le saoránaigh Éireannacha

source: • Apply to the Minister for Justice and Equality for permission for a member of your family to enter and reside in the State, in accordance with Section 56 of the International Protection Act 2015
ga: • Cur isteach ar an Aire Dlí, agus Cirt agus Comhionnanais do chead chun ball de do theaghlach a ligean isteach agus cónaí sa Stát, de réir Roinn 56 den Acht um Chosaint Idirnáisiúnta 2015

source: Under the terms of the 1951 Geneva Convention, as a refugee you are entitled to:
ga: I gcomhréir le Coinbhinsiún na Ginéive, 1951, mar theifeach, tá tú i dteideal:

source: • Have the same freedom to practise your religion and the same freedom as regards religious education of your child as an Irish citizen
ga: • An tsaoirse chéanna le do chreideamh a chleachtadh agus an tsaoirse chéanna maidir le hoideachas creidimh do linbh le saoránach Éireannach

source: • Have the same access to the courts as an Irish citizen
ga: • An rochtain chéanna ar na cúirteanna a bheith agat le saoránach Éireannach

source: • Have the same right to form and be a member of associations and trade unions as an Irish citizen
ga: • an ceart céanna a bheith agat chun cumainn agus ceardchumainn a bhunú agus a bheith i do bhall díobh le saoránach Éireannach

source: • Acquire, hold, dispose or otherwise deal with real or personal property or an interest in such property in the same way and subject to the same obligations and limitations as an Irish citizen
ga: • Maoin réadach nó phearsanta nó leas sa mhaoin sin a shealbhú, a choinneáil, a dhiúscairt nó déileáil ar bhealach éigin eile léi sa tslí chéanna agus faoi réir na n-oibleagáidí agus na dteorainneacha céanna le saoránach Éireannach

source: If you are refused a declaration
ga: Má tá dearbhú diúltaithe

source: If the International Protection Office or the International Protection Appeals Tribunal recommends to the Minister for Justice and Equality that you should be refused a refugee or subsidiary protection declaration, the Minister may refuse to give you a refugee or subsidiary protection declaration
ga: Má mholann an Oifig um Chosaint Idirnáisiúnta nó an Bínse Achomharic um Chosaint Idirnáisiúnta don Aire Dlí, Cirt agus Comhionnanais gur cheart dearbhú teifigh nó dearbhú cosanta tánaisteach a dhiúltú duit, is féidir leis an Aire diúltú duit dearbhú teifigh nó dearbhú cosaint tánaisteach a thabhairt duit

source: You will be sent a notice in writing stating that your application for a refugee or subsidiary protection declaration has been refused
ga: Seolfar fógra i scríbhinn chugat ag maíomh gur diúltaíodh do d’iarratas ar dhearbhú mar theifeach nó dearbú cosanta tánaisteach

source: If your application for a refugee or subsidiary protection declaration has been refused, the Minister may inform you in writing that you may withdraw your application and return voluntarily to your country of origin
ga: Má tá d'iarratas ar dhearbhú mar theifeach nó chosaint thánaisteach diúltaithe, is féidir leis an Aire thú a chur ar an eolas i scríbhinn gur féidir leat d'iarratas a aistharraingt agus filleadh go deonach ar do thír dhúchais

source: If you confirm to the Minister that you will comply with this, the Minister will not make a deportation order requiring you to leave the State
ga: Má chintíonn tú leis an Aire go gcomhlíonfaidh tú leis seo, ní dhéanfaidh an tAire ord díbeartha a chuireann ort an Stát a fhágáil

source: If the International Protection Office has made a recommendation that you should be refused a refugee or subsidiary protection declaration, and this recommendation has not been overturned by the International Protection Appeals Tribunal, the Minister may consider whether you should be given permission to remain in the State
ga: Má tá moladh déanta ag an Oifig um Chosaint Idirnáisiúnta gur cheart dearbhú teifigh nó dearbhú cosanta tánaisteach a dhiúltú, agus go bhfuarthas réidh leis an moladh sin ag an mBínse Achomharic um Chosaint Idirnáisiúnta, is féidir leis an Aire cead fanachta a thabhairt duit

source: When deciding this, under section 49 of the Act, the Minister must have regard to your family and personal circumstances including your connection with the State (if any), humanitarian considerations and considerations of national security and public order
ga: Agus an cinneadh seo á dhéanamh, faoi roinn 49 den Acht, ba cheart don Aire do theaghlach agus cúinsí pearsanta a chur san áireamh le cois do nasc leis an Stát (más ann dó), cúrsaí daonnúlacha agus cúrsaí slándála náisiúnta agus ord poilblí

source: If the Minister makes a deportation order to remove you from the State
ga: Má bheartaíonn an tAire Dlí agus Cirt ordú díbeartha le do bhaint den stát

source: If the Minister for Justice and Equality has refused to give you a refugee or subsidiary protection declaration or permission to remain, the Minister may make a deportation order against you in accordance with the Immigration Act 1999, as amended
ga: Má dhiúltaigh an tAire Dlí agus Cirt agus Comhionannais dearbhú teifigh nó dearbhú cosanta tánaisteach nó cead fanachta duit, de réir an Acht Inimirce 1999, arna leasaithe, féadann an tAire Dlí agus Cirt ordú díbeartha a bheartú i do choinne

source: The notice of the deportation order may require you to leave the State within a specified period and to present yourself to a member of the Garda Síochána or immigration officer at a date, time and place as specified in the order
ga: Seans gcuirfidh an t-ordú díbeartha iachall ort an Stát a fhágáil taobh istigh de thréimhse shonraithe agus tú féin a chur i láthair chuig ball den Gharda Síochána nó chuig Oifigeach Inimirce ag dáta, am agus áit mar atá sonraithe san ord

source: Where an immigration officer or a member of An Garda Síochána, with reasonable cause, suspects that a person against whom a deportation order is in force:
ga: Sa chás go mbíonn oifigeach inimirce nó ball den Gharda Síochána amhrasach, le cúis réasúnta, faoi dhuine a bhfuil ordú díbeartha i bhfeidhm ina gcoinne:

source: • Has failed to comply with any provision of the order or with a requirement
ga: • Gur theip orthu chun cloí le haon fhoráil den ordú nó le riachtanas

source: • Intends to leave the State and enter another state illegally
ga: • Go bhfuil sé ar intinn acu an stát a fhágáil agus ceann eile a iontráil go mídhleachtach

source: • Has destroyed identity documents or is in possession of forged identity documents or
ga: • Gur scrios siad cáipéisí aitheantais nó go bhfuil siad i seilbh cáipéisí aitheantais brionnaithe nó

source: • Intends to avoid deportation
ga: • Go bhfuil rún acu a chun a ndíbirt a sheachaint

source: The officer concerned may arrest that person without warrant and detain that person in a prescribed place or may transport them to a ship, aircraft, road vehicle or train that is due to leave the State
ga: Féadann an tOifigeach i gceist an duine sin a ghabháil gan barántas agus an duine sin a choinneáil in ionad forordaithe nó iad a iompar ar long, eitleán, feithicil nó traen a bheas ag fágáil an Stáit

source: Under section 78 of the International Protection Act 2015, for the purposes of arresting that person, the officer may enter (using reasonable force if necessary) and search any premises where the person is or where the officer suspects the person is
ga: Faoi roinn 78 den Acht um Chosaint Idirnáisiúnta 2015, chun an duine sin a ghabháil, is féidir leis an oifigeach aon áitreabh ina bhfuil an duine nó a gceapann an t-oifigeach go bhfuil sé/sí ann (ag baint úsáid as fórsa réasúnach más gá)

source: If it is a dwelling, the officer will not enter without consent unless the person is ordinarily resident there or the officer has reasonable grounds for believing the person is there
ga: Más áit chónaithe í, ní rachaidh an t-oifigeach isteach gan chead mura bhfuil an duine ina c(h)ónaí ann go hiondúil nó go gceapann an t-oifigeach ar chúinsí réasúnacha go bhfuil an duine sin ann

source: Revocation of a refugee declaration
ga: Cúlghairm an dearbhaithe mar theifeach

source: The Minister for Justice and Equality may decide to revoke a refugee declaration given to a person where they:
ga: Féadann an tAire Dlí agus Cirt a chinneadh dearbhú mar theifeach a chúlghairm, sna cúinsí ina ndéanann teifeach:

source: • Voluntarily re-avail of the protection of the country of their nationality
ga: • Cosaint thír a náisiúntachta a athfháil go deonach

source: • Voluntarily reacquire their lost nationality
ga: • A náisiúntacht chaillte a athshealbhú go deonach

source: • Acquire a new nationality (other than as an Irish citizen) and enjoy the protection of the country of their own nationality
ga: • Náisiúntacht nua a shealbhú (nach náisiúntacht an stáit í) agus cosaint thír a náisiúntachta féin a fháil

source: • Voluntarily re-establish themselves in the country, which they left or outside which they remained owing to fear of persecution
ga: • É nó í féin a athbhunú go deonach sa tír a d’fhag sé nó sí nó ar fhan sé nó sí lasmuigh di de bharr eagla na géarleanúna

source: • Can no longer continue to refuse to avail of the protection of the country of their nationality because the circumstances that led to them being recognised as a refugee have ceased to exist
ga: • Nach féidir leo leanúint de bheith ag diúltú d’fháil chosaint thír a náisiúntachta toisc na cúinsí as ar eascraigh a n-aithint mar theifeach a bheith tagtha chun éagtha

source: • Have no nationality and are able to return to the country of their former habitual residence because the circumstances that led to them being recognised as a refugee have ceased to exist
ga: • Gur duine iad nach bhfuil aon náisiúntacht acu agus nach féidir leo filleadh ar thír a iar-ghnáthchónaithe toisc na cúinsí as ar eascraigh a n-aithint mar theifeach a bheith tagtha chun éagtha

source: • Have committed a crime against peace, a war crime or a crime against humanity
ga: • Gur duine iad a rinne coir i gcoinne síochána, coir chogaidh nó coir i gcoinne na daonnachta

source: • Have committed a serious non-political crime outside the State prior to your arrival in it
ga: • Gur iad iad a rinne coir dháiríre neamhpholaitiúil taobh amuigh den Stát roimh theacht go dtí é

source: • Are guilty of acts contrary to the purposes and principles of the United Nations
ga: • Gur duine iad ciontach as gníomhartha i gconrárthacht le haidhmeanna agus prionsabail na Náisiún Aontaithe

source: • Are a person whose presence in the State poses a threat to national security or, having been convicted of a serious crime, a threat to the community in the State or
ga: • Gur duine iad ar bagairt don tslándáil náisiúnta nó don bheartas poiblí í a láithreacht sa stát, mar gur ciontaíodh iad as coir dháiríre, bagairt don phobal sa Stát nó

source: • Were given a refugee declaration on the basis of information furnished which was false or misleading
ga: • Gur duine iad ar tugadh dearbhú mar theifeach dóibh ar bhonn faisnéise a tugadh arbh bhréagach nó míthreorach í

source: Revocation of a subsidiary protection declaration
ga: Cúlghairm ar dhearbhí cosanta táánaisteach

source: The Minister for Justice and Equality may decide to revoke a subsidiary protection declaration given to a person where:
ga: Féadann an tAire Dlí, Cirt agus Comhionnanais beartú a dhéanamh dearbhú cosanta tánaisteach a aisghairm nuair atá a leithéid i gceist:

source: • The circumstances that led to them being eligible for subsidiary protection have ceased to exist or have changed so that international protection is no longer required •They have committed a crime against peace, a war crime or a crime against humanity
ga: • Ní mhaireann na cúisní a thuilleadh as a raibh siad i dteideal cosaint tánaisteach nó go bhfuil siad athraithe ionas nach bhfuil an chosaint idirnáisiúnta de dhíth a thuilleadh. Rinne siad coir i gcoinne na síochána, coir chogaidh nó coir i gcoinne na daonnúlachta

source: • They have committed a serious crime
ga: • Rinne siad coir dháiríre

source: • They are guilty of acts contrary to the purposes and principles of the United Nations or
ga: • Tá siad iad ciontach as gníomhartha i gconrárthacht le haidhmeanna agus prionsabail na Náisiún Aontaithe nó

source: • Their presence in the State poses a danger to the community or the security of the State
ga: • Iad duine iad ar bagairt don tslándáil náisiúnta nó don bheartas poiblí í a láithreacht sa Stát

source: Where the Minister proposes to revoke a declaration, the person concerned will be notified and will have 15 working days from the issue of the notification to make representations to the Minister
ga: Nuair a bheartaíonn an tAire dearbhú a chúlghairm, tabharfar fógra don duine agus beidh 15 lá oibre aige/aici ó eisiúint an fhógra chun ionadaíochtaí a dhéanamh don Aire

source: In cases where the Minister decides to revoke a declaration, the person concerned will have 10 working days from the sending of the notice containing the decision and the reasons for it to appeal to the Circuit Court
ga: I gcásanna nuair a chinneann an tAire dearbhú a chúlghairm, beidh 10 lá oibre ag an duine ó eisiúint an fhógra ina bhfuil an beartú agus na cúiseanna taobh thiar de chun achomharc a dhéanamh don Chúirt Chuarda

source: National security and public policy considerations
ga: Cúrsaí maidir le slándáil náisiúnta agus polasaí poiblí

source: Under the International Protection Act 2015, if the Minister for Justice and Equality considers that, in the interest of national security or public policy (ordre public), it is necessary to do so, the Minister may provide that the right to travel, renewal of leave to remain in the State and/or family reunification shall not apply to a person who has been given a refugee declaration or a subsidiary protection declaration
ga: Faoin Acht um Chosaint Idirnáisiúnta 2015, má bheartaíonn an tAire Dlí agus Cirt agus Comhionnanais, ar mhaithe le slándáil náisiúnta nó polasaí poiblí (beartas poiblí), gur ghá amhlaidh a dhéanamh, is féidir leis an Aire a mhaíomh nach mbaineann an ceart chun taistil, athnuachan ar fhágáil chun fanacht sa Stát agus/nó athaontú teaghlaigh, do dhuine a tugadh deaarbhú teifigh nó dearbhú cosanta tánaisteach dó/di
